Repository: rafolaerts/RideWeather-MVP
Catalog: RideWeather/*.lproj/Localizable.strings
Languages: nl

source: Error Handling
nl: Foutafhandeling

source: Developer tools
nl: Ontwikkelaar tools

source: Advanced debugging and testing tools for developers
nl: Geavanceerde debugging en test tools voor ontwikkelaars

source: Weather API Debug
nl: Weer API Debug

source: No trips yet
nl: Nog geen trips

source: Add your first motorcycle trip to view weather along your route
nl: Voeg je eerste motorfiets trip toe om het weer langs je route te bekijken

source: Date (newest first)
nl: Datum (nieuwste eerst)

source: Date (oldest first)
nl: Datum (oudste eerst)

source: Name (A-Z)
nl: Naam (A-Z)

source: Name (Z-A)
nl: Naam (Z-A)

source: Distance (longest first)
nl: Afstand (langste eerst)

source: Distance (shortest first)
nl: Afstand (kortste eerst)

source: Time (longest first)
nl: Tijd (langste eerst)

source: Time (shortest first)
nl: Tijd (kortste eerst)

source: Settings
nl: Instellingen

source: Done
nl: Gereed

source: WEATHER SETTINGS
nl: WEER INSTELLINGEN

source: Rain marking rule
nl: Regen markering regel

source: Determine when a route is marked as 'bad weather'
nl: Bepaal wanneer een route als 'slecht weer' wordt gemarkeerd

source: Rain rule type
nl: Regen regel type

source: Rain chance AND amount
nl: Regenkans EN hoeveelheid

source: Rain chance only
nl: Alleen regenkans

source: Rain amount only
nl: Alleen regenhoeveelheid

source: Rain chance threshold
nl: Regenkans drempel

source: Minimum rain chance (%) to mark as 'bad weather'
nl: Minimum regenkans (%) om als 'slecht weer' te markeren

source: Rain amount threshold
nl: Regenhoeveelheid drempel

source: Minimum rain amount (mm) to mark as 'bad weather'
nl: Minimum regenhoeveelheid (mm) om als 'slecht weer' te markeren

source: GENERAL SETTINGS
nl: ALGEMENE INSTELLINGEN

source: Metric units
nl: Metrische eenheden

source: Use kilometers and Celsius instead of miles and Fahrenheit
nl: Gebruik kilometers en Celsius in plaats van mijlen en Fahrenheit

source: LANGUAGE SETTINGS
nl: TAAL INSTELLINGEN

source: App language
nl: App taal

source: Choose the language for the app interface
nl: Kies de taal voor de app interface

source: Dutch
nl: Nederlands

source: English
nl: Engels

source: APP INFORMATION
nl: APP INFORMATIE

source: Version
nl: Versie

source: Add Trip
nl: Trip Toevoegen

source: Trip name
nl: Trip naam

source: Enter trip name
nl: Voer trip naam in

source: Start location
nl: Start locatie

source: Enter start location
nl: Voer start locatie in

source: Destination
nl: Bestemming

source: Enter destination
nl: Voer bestemming in

source: Start time
nl: Vertrektijd

source: Arrival time
nl: Aankomsttijd

source: Add waypoint
nl: Wegpunt toevoegen

source: Remove waypoint
nl: Wegpunt verwijderen

source: Plan route
nl: Route plannen

source: Cancel
nl: Annuleren

source: Save
nl: Opslaan

source: Distance
nl: Afstand

source: Duration
nl: Duur

source: End
nl: Einde

source: Route point
nl: Route punt

source: Edit trip
nl: Trip bewerken

source: Delete trip
nl: Trip verwijderen

source: Are you sure you want to delete this trip?
nl: Weet je zeker dat je deze trip wilt verwijderen?

source: Delete
nl: Verwijderen

source: Route planning...
nl: Route plannen...

source: Route planned successfully
nl: Route succesvol gepland

source: Failed to plan route
nl: Route plannen mislukt

source: Current location
nl: Huidige locatie

source: Use current location
nl: Huidige locatie gebruiken

source: Location permission required
nl: Locatie toestemming vereist

source: Please enable location access in Settings
nl: Schakel locatie toegang in via Instellingen

source: Weather data
nl: Weer gegevens

source: Temperature
nl: Temperatuur

source: Rain chance
nl: Regenkans

source: Rain amount
nl: Regenhoeveelheid

source: Good weather
nl: Goed weer

source: Distance: %.1f %@
nl: Afstand: %.1f %@

source: Avg. speed: %.0f %@
nl: Gem. snelheid: %.0f %@

source: route points
nl: route punten

source: New GPX file is being loaded...
nl: Nieuw GPX bestand wordt geladen...

source: New GPX file selected:
nl: Nieuw GPX bestand geselecteerd:

source: Network Status
nl: Netwerk Status

source: Available
nl: Beschikbaar

source: Not available
nl: Niet beschikbaar

source: Last Error
nl: Laatste Fout

source: Ready
nl: Gereed

source: Loading...
nl: Laden...

source: Recovery Suggestion
nl: Recovery Suggestie

source: No suggestion
nl: Geen suggestie

source: Validate Data
nl: Valideer Data

source: Try Recovery
nl: Probeer Recovery

source: Route Planning
nl: Route Plannen

source: Plan Route
nl: Route Plannen

source: Map
nl: Kaart

source: Route Information
nl: Route Informatie

source: Filename
nl: Bestandsnaam

source: Total distance
nl: Totale afstand

source: Route Points
nl: Route Punten

source: Elevation: %dm
nl: Hoogte: %dm

source: No internet connection available
nl: Geen internetverbinding beschikbaar

source: Unknown
nl: Onbekend

source: Unknown location
nl: Onbekende locatie

source: No weather data available
nl: Geen weer data beschikbaar

source: Invalid response from weather service
nl: Ongeldige response van weer service

source: Weather service error %d: %@
nl: Weer service fout %d: %@

source: Weather service error: %d
nl: Weer service fout: %d

source: Network error: %@
nl: Netwerk fout: %@

source: Invalid URL for weather API
nl: Ongeldige URL voor weer API

source: Error decoding weather data: %@
nl: Fout bij decoderen van weer data: %@

source: Timeout while fetching weather data
nl: Timeout bij ophalen weer data

source: Too many API calls, try again later
nl: Te veel API calls, probeer het later opnieuw

source: Invalid API key
nl: Ongeldige API sleutel

source: Location service error: %@
nl: Locatie service fout: %@

source: Check your internet connection and try again
nl: Controleer je internetverbinding en probeer het opnieuw

source: The server is responding slowly, try again later
nl: De server reageert traag, probeer het later opnieuw

source: Wait a few minutes before trying again
nl: Wacht enkele minuten voordat je het opnieuw probeert

source: Contact the developer
nl: Neem contact op met de ontwikkelaar

source: Server problem, try again later
nl: Server probleem, probeer het later opnieuw

source: Authentication error, contact the developer
nl: Authenticatie fout, neem contact op met de ontwikkelaar

source: Try again later
nl: Probeer het later opnieuw

source: Try again
nl: Probeer het opnieuw

source: No internet connection
nl: Geen internetverbinding

source: Connection lost
nl: Verbinding verbroken

source: Server unreachable
nl: Server niet bereikbaar

source: DNS lookup failed
nl: DNS lookup mislukt

source: SSL/TLS error
nl: SSL/TLS fout

source: Unknown network error: %@
nl: Onbekende netwerk fout: %@

source: Try again. If the problem persists, restart the app.
nl: Probeer het opnieuw. Als het probleem aanhoudt, herstart de app.

source: Try again or restart the app.
nl: Probeer het opnieuw of herstart de app.

source: Some data is invalid. Try restarting the app.
nl: Sommige data is ongeldig. Probeer de app te herstarten.

source: Restart the app to restore the database.
nl: Herstart de app om de database te herstellen.

source: Contact the developer.
nl: Neem contact op met de ontwikkelaar.

source: The app is trying to migrate your data. Wait a moment and try again.
nl: De app probeert je data te migreren. Wacht even en probeer het opnieuw.

source: Your data is corrupted. Restart the app to try to fix this.
nl: Je data is beschadigd. Herstart de app om te proberen dit op te lossen.

source: Error Recovery Actions
nl: Foutherstel Acties

source: Clear All Errors
nl: Alle Fouten Wissen

source: Refresh Context
nl: Context Vernieuwen

source: Test Save Recovery
nl: Test Opslaan Herstel

source: Test network error - no internet connection
nl: Test netwerk fout - geen internetverbinding

source: ✅ All data is valid
nl: ✅ Alle data is geldig

source: ❌ Validation errors found:
nl: ❌ Validatie fouten gevonden:

source: ✅ Recovery successful
nl: ✅ Recovery succesvol

source: ❌ Recovery failed
nl: ❌ Recovery mislukt

source: ✅ Save recovery successful
nl: ✅ Save recovery succesvol

source: ❌ Save recovery failed
nl: ❌ Save recovery mislukt

source: Trips
nl: Ritten

source: 5 points (very few)
nl: 5 punten (zeer weinig)

source: 10 points (standard)
nl: 10 punten (standaard)

source: 15 points (medium)
nl: 15 punten (gemiddeld)

source: 20 points (many)
nl: 20 punten (veel)

source: 25 points (very many)
nl: 25 punten (zeer veel)

source: Trip Information
nl: Rit Informatie

source: Trip name:
nl: Rit naam:

source: Date:
nl: Datum:

source: Start time:
nl: Start tijd:

source: Arrival time:
nl: Aankomst tijd:

source: ROUTE FILE
nl: ROUTE BESTAND

source: GPX file loaded:
nl: GPX bestand geladen:

source: Total distance:
nl: Totale afstand:

source: Estimated avg. speed:
nl: Geschatte gem. snelheid:

source: waypoints found
nl: waypoints gevonden

source: route points used
nl: route punten gebruikt

source: Route points setting
nl: Route punten instelling

source: More points mean more detailed route but slower processing
nl: Meer punten betekenen gedetailleerdere route maar langzamere verwerking

source: Number of route points
nl: Aantal route punten

source: Select different GPX file
nl: Selecteer ander GPX bestand

source: Select GPX File
nl: Selecteer GPX Bestand

source: 5 minutes before departure
nl: 5 minuten voor vertrek

source: 10 minutes before departure
nl: 10 minuten voor vertrek

source: 15 minutes before departure
nl: 15 minuten voor vertrek

source: 30 minutes before departure
nl: 30 minuten voor vertrek

source: Rain notification
nl: Regen notificatie

source: When you want to be warned about rain
nl: Wanneer je gewaarschuwd wilt worden over regen

source: Notification time
nl: Notificatie tijd

source: Language changed
nl: Taal gewijzigd

source: The app language has been changed. Restart the app to apply all changes.
nl: De app taal is gewijzigd. Herstart de app om alle wijzigingen toe te passen.

source: Sort
nl: Sorteren

source: No weather data
nl: Geen weer data

source: Route Overview
nl: Route Overzicht

source: High chance of rain
nl: Hoge kans op regen

source: Cold temperature
nl: Koude temperatuur

source: h
nl: u

source: ERROR HANDLING
nl: FOUTAFHANDELING

source: Error management
nl: Foutbeheer

source: Monitor and resolve app errors and data issues
nl: Bewaak en los app fouten en data problemen op

source: Open Error Handling
nl: Open Foutafhandeling

source: Bad weather
nl: Slecht weer

source: Error
nl: Fout

source: Warning
nl: Waarschuwing

source: Information
nl: Informatie

source: Retry
nl: Opnieuw proberen

source: Close
nl: Sluiten

source: Edit
nl: Bewerken

source: GPX file loaded: %@
nl: GPX bestand geladen: %@

source: Total distance: %.1f km
nl: Totale afstand: %.1f km

source: Estimated avg. speed: %.0f %@
nl: Geschatte gem. snelheid: %.0f %@

source: Error selecting file: %@
nl: Fout bij het selecteren van bestand: %@

source: Error reprocessing GPX file: %@
nl: Fout bij herverwerken van GPX bestand: %@

source: Edit Trip
nl: Trip Bewerken

source: Rain Focus
nl: Regen Focus

source: Refresh
nl: Vernieuwen

source: No route points
nl: Geen route punten

source: Route points are calculated after GPX import
nl: Route punten worden berekend na GPX import

source: Arrival
nl: Aankomst

source: Average speed
nl: Gemiddelde snelheid

source: Route file
nl: Route bestand

source: Chance of rain
nl: Kans op regen

source: API CONFIGURATION
nl: API CONFIGURATIE

source: OpenWeatherMap API Key
nl: OpenWeatherMap API Sleutel

source: Enter your own OpenWeatherMap API key for weather data
nl: Voer je eigen OpenWeatherMap API sleutel in voor weer data

source: API Key
nl: API Sleutel

source: Get Free Key
nl: Gratis Sleutel

source: Enter your API key here
nl: Voer je API sleutel hier in

source: Save API Key
nl: API Sleutel Opslaan

source: Remove API Key
nl: API Sleutel Verwijderen

source: Current Key
nl: Huidige Sleutel

source: Invalid API Key Format
nl: Ongeldig API Sleutel Formaat

source: OpenWeatherMap API keys must be exactly 32 characters long.
nl: OpenWeatherMap API sleutels moeten precies 32 karakters lang zijn.

source: API Key Saved
nl: API Sleutel Opgeslagen

source: Your OpenWeatherMap API key has been saved successfully.
nl: Je OpenWeatherMap API sleutel is succesvol opgeslagen.

source: API Key Removed
nl: API Sleutel Verwijderd

source: Your OpenWeatherMap API key has been removed. The app will use the default API key if available.
nl: Je OpenWeatherMap API sleutel is verwijderd. De app zal de standaard API sleutel gebruiken indien beschikbaar.

source: Weather functionality limited
nl: Weer functionaliteit beperkt

source: No OpenWeatherMap API key configured
nl: Geen OpenWeatherMap API sleutel geconfigureerd

source: Invalid API key detected
nl: Ongeldige API sleutel gedetecteerd

source: Your API key appears to be invalid
nl: Je API sleutel lijkt ongeldig te zijn

source: API key configured
nl: API sleutel geconfigureerd

source: Weather functionality is available
nl: Weer functionaliteit is beschikbaar

source: Privacy Policy
nl: Privacybeleid
